Revit 2027 API
TextBox.PromptText Property
The prompt text for the text box.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string PromptText { get; set; }
Public Property PromptText As String
	Get
	Set
public:
property String^ PromptText {
	String^ get ();
	void set (String^ value);
}
member PromptText : string with get, set
Property Value
String
Remarks
Prompt text is displayed when the text box is empty and does not have keyboard focus. This text is displayed in italics. The default value is null.
See Also
Reference
TextBox Class
Autodesk.Revit.UI Namespace